export const radioInputData = [
  ['남자', 'gender', '60px', 0],
  ['여자', 'gender', '60px', 0],
  ['선택안함', 'gender', '91px', 1],
];

export const singleSelectData = [
  [
    [
      { value: '10대', label: '10대' },
      { value: '20대', label: '20대' },
      { value: '30대', label: '30대' },
      { value: '40대', label: '40대' },
      { value: '50대', label: '50대' },
      { value: '60대 이상', label: '60대 이상' },
    ],
    '나이',
  ],
  [
    [
      { value: '서버/백엔드', label: '서버/백엔드' },
      { value: '프론트엔드', label: '프론트엔드' },
      { value: '풀스택', label: '풀스택' },
      { value: '머신러닝/인공지능', label: '머신러닝/인공지능' },
      { value: '학생', label: '학생' },
      { value: '데이터분석', label: '데이터분석' },
      { value: 'Android', label: 'Android' },
      { value: 'IOS', label: 'IOS' },
      { value: '기타', label: '기타' },
    ],
    '직무',
  ],
];

export const multiSelectData = [
  [
    { value: 'C', label: 'C' },
    { value: 'C++', label: 'C++' },
    { value: 'C#', label: 'C#' },
    { value: 'Java', label: 'Java' },
    { value: 'JavaScript', label: 'JavaScript' },
    { value: 'Python', label: 'Python' },
    { value: 'SQL', label: 'SQL' },
    { value: 'PHP', label: 'PHP' },
    { value: '기타', label: '기타' },
  ],
  '언어',
];

export const AccessTermsData = [
  [
    '개인정보수집 및 이용 약관',
    '01. 개인정보처리방침이란?\n200ok(이하 “회사”이라 한다)는 은 이용자의 ‘동의를 기반으로 개인정보를 수집•이용 및 제공’ 하고 있으며, ‘이용자의 권리 (개인정보 자기결정권)를 적극적으로 보장’ 합니다.\n“개인정보처리방침”이란 이용자의 소중한 개인정보를 보호하여 안심하고 서비스를 이용할 수 있도록 회사가 준수해야 할 지침을 말합니다.\n\n02. 개인정보 수집\n모든 이용자는 회사가 제공하는 서비스를 이용할 수 있고, 구독 신청을 통해 회사의 다양한 서비스를 제공받을 수 있습니다.\n그리고 이때 회사는 다음의 원칙 하에 이용자의 개인정보를 수집하고 있습니다.\n1. 회사는 서비스 제공에 필요한 최소한의 개인정보를 수집하고 있습니다.\n* 필수정보의 수집 : 닉네임, 이메일\n* 회원가입 및 프로필 편집 시 선택적으로 성별, 나이, 직무, 프로그래밍 언어 등이 수집될 수 있습니다. 수집된 개인정보는 통계 자료 제공 및 향후 맞춤형 서비스를 위해 활용되며, 입력하지 않더라도 서비스 이용에 지장이 없습니다.\n2. 서비스 이용과정에서 아래와 같은 정보들이 자동으로 생성되어 수집될 수 있습니다.\n* IP Address, 쿠키, 방문 일시, 서비스 이용 기록, 불량 이용 기록됩니다.\n3. 회사는 민감정보를 수집하지 않습니다.\n회사는 이용자의 소중한 인권을 침해할 우려가 있는 민감한 정보는 어떠한 경우에도 수집하지 않으며, 만약 법령에서 정한 의무에 따라 불가피하게 수집하는 경우에는 반드시 이용자에게 사전 동의를 거치겠습니다.\n회사는 이용자의 개인정보를 구독 신청 외에도 각종 서비스 제공, 오프라인 행사 개최 시 웹사이트, 이메일, 팩스, 전화 등을 통해 수집하게 됩니다.\n\n03. 개인정보 이용\n회사는 이용자의 소중한 개인정보를 다음과 같은 목적으로만 이용하며, 목적이 변경될 경우에는 사전에 이용자의 동의를 구하도록 하겠습니다.\n1. 이용자에게 회사의 다양한 서비스(뉴스레터 및 향후 신규 서비스) 를 제공하고 서비스 이용 과정에서 이용자의 문의사항이나 불만을 처리하고 공지사항 등을 전달하기 위해 사용합니다.\n2. 신규 서비스가 개발되거나 이벤트 행사 시 참여기회를 알리기 위한 정보 전달 및 맞춤형 서비스 제공 등 마케팅 및 광고 등에도 사용됩니다.\n3. 맞춤형 서비스 제공 및 신규 서비스 개발 등에 참고하기 위하여 이를 익명화하여, 이용패턴과 접속빈도 분석 및 서비스 이용에 대한 통계에서도 사용됩니다.\n또한, 회사 이용자의 개인정보를 회원가입을 하는 시점부터 서비스를 제공하는 기간 동안에만 제한적으로 이용하고 있습니다. 이용자가 회원탈퇴를 요청하거나 제공한 개인정보의 수집 및 이용에 대한 동의를 철회하는 경우, 또는 수집 및 이용목적이 달성되거나 보유 및 이용기간이 종료한 경우 해당 이용자의 개인정보는 지체 없이 파기 됩니다.\n\n04. 개인정보의 취급위탁\n회사는 서비스 향상을 위해서 아래와 같이 개인정보를 위탁하고 있으며, 관계 법령에 따라 위탁계약 시 개인정보가 안전하게 관리될 수 있도록 필요한 사항을 규정하고 있습니다. 위탁업무의 내용이나 수탁자가 변경될 경우에는 지체없이 본 개인정보 처리방침을 통하여 공개하도록 하겠습니다. 회사의 개인정보 위탁처리 기관 및 위탁업무 내용은 아래와 같습니다\n수탁업체: MONGODB ATLAS, Amazon Web Services Inc.\n위탁 업무 내용: 개인정보가 저장된 국내 클라우드 서버 운영 및 관리\n개인정보의 보유 및 이용기간: 회원탈퇴시 혹은 위탁계약 종료시까지\n\n05. 개인정보 파기\n회사는 이용자의 개인정보에 대해 “개인정보의 수집•이용 목적이 달성”된 후에는 해당 정보를 지체 없이 파기함을 약속합니다.\n그리고 기간이 종료되면 재생할 수 없는 기술적인 방법을 이용하여 완전하게 삭제하게 되고, 종이로 출력된 개인정보는 분쇄 하거나 소각하여 파기하게 됩니다.\n\n06. 이용자 권리 보호\n회사는 이용자의 권리를 다음과 같이 보호하고 있습니다.\n1. 언제든지 등록되어 있는 자신의 개인정보를 조회하고 수정할 수 있습니다. (개인정보의 조회/수정을 위해서는 ‘정보수정’ 메뉴를 클릭 후 비밀번호 재인증 절차를 거친 후 직접 조회/수정이 가능합니다.\n2. 언제든지 개인정보 제공에 관한 동의철회/구독해지를 요청할 수 있습니다. (구독해지를 위해서는 뉴스레터 하단의 ‘구독 취소하기’ 버튼을 클릭하시면 됩니다.)\n이용자는 웹 브라우저에서 옵션을 설정함으로써 모든 쿠키를 허용하거나, 쿠키가 저장될 때마다 확인을 거치거나, 모든 쿠키의 저장을 거부할 수도 있습니다. 다만 쿠키 설치를 거부할 경우 웹 사용이 불편해지며 로그인이 필요한 일부 서비스 이용에 어려움이 있을 수 있습니다.\n\nChrome의 경우 : 웹 브라우저 우측의 설정 메뉴 > 화면 하단의 고급 설정 표시 > 개인정보의 콘텐츠 설정 버튼 > 쿠키\n정확한 개인정보의 이용 및 제공을 위해 수정이 완료될 때까지 이용자의 개인정보는 이용되거나 제공되지 않습니다. 또한 이미 제3자에게 제공된 경우에는 지체 없이 제공받은 자에게 사실을 알려 수정이 이루어질 수 있도록 하겠습니다.\n\n07. 개인정보의 안정성 확보조치\n회사는 이용자의 개인정보를 가장 소중한 가치로 여기고 개인정보를 취급함에 있어서 다음과 같은 노력을 다하고 있습니다.\n1. 이용자의 개인정보를 암호화하고 있습니다.\n회사는 이용자의 개인정보를 암호화된 통신구간을 이용하여 전송하고, 중요정보는 암호화하여 보관하고 있습니다.\n2. 해킹이나 컴퓨터 바이러스로부터 보호하기 위하여 노력하고 있습니다.\n회사는 해킹이나 컴퓨터 바이러스 등에 의해 이용자의 개인정보가 유출되거나 훼손되는 것을 막기 위해 외부로부터 접근이 통제된 구역에 시스템을 설치하고 있습니다.\n해커 등의 침입을 탐지하고 차단할 수 있는 시스템을 설치하여 24시간 감시하고 있으며, 백신 프로그램을 설치하여 시스템이 최신 악성코드나 바이러스에 감염되지 않도록 노력하고 있습니다.\n3. 소중한 개인정보에 접근할 수 있는 사람을 최소화하고 있습니다.\n회사는 개인정보를 취급하는 직원을 최소화 하여 개인정보 유출에 대한 위험을 줄이고 있습니다. 또한 개인정보를 보관하는 데이터베이스 시스템과 개인정보를 처리하는 시스템에 대한\n비밀번호의 생성과 변경, 그리고 접근할 수 있는 권한에 대한 체계적인 기준을 마련하고 지속적인 감사를 실시하고 있습니다.\n4. 임직원에게 이용자의 개인정보 보호에 대해 정기적인 교육을 실시하고 있습니다.\n개인정보를 취급하는 모든 임직원들을 대상으로 개인정보보호 의무와 보안에 대한 정기적인 교육을 실시하고 있습니다.',
  ],
  [
    '뉴스레터 신청 개인정보 수집 약관',
    '1. 개인정보 수집 및 이용목적\n뉴스레터 구독 및 마케팅 활용\n- 사용자의 특성에 맞는 기업 서비스 제공\n- 이용자의 통계적 분석 및 마케팅 활동에 이용\n\n2. 수집하는 개인정보 항목\n이메일 주소\n\n3. 개인정보 보유 및 이용기간\n회사는 서비스를 제공하는 기간 동안에 한하여 이용자의 개인정보를 보유 및 이용하게 됩니다. 수집 및 이용목적이 달성되거나 보유 및 이용기간이 종료한 경우 해당 개인정보를 지체 없이 파기합니다.\n\n4. 개인정보 수집 및 이용 동의 및 거부에 관한 사항\nDEVzine:port는 뉴스레터 구독 서비스 제공 목적으로 개인정보를 수집·이용합니다.\n- 개인정보 수집·이용 목적에 대한 자세한 사항은 상기 ‘개인정보 수집·이용 목적’에서 확인할 수 있습니다.\n- [뉴스레터 구독 서비스] 신청자는 원칙적으로 개인정보 수집·이용에 대해 거부할 권리를 가지고 있습니다. 단, 동의 거부를 하였을 경우 이메일을 수신할 수 없습니다.\n- [뉴스레터 구독 서비스]를 통해 발송된 메일의 구독 취소하기 기능을 통해 개인정보 수집·이용을 거부할 수 있습니다.',
  ],
  [
    '서비스 이용 약관',
    '제1조(목적)\n이 약관은 회원(이 약관에 동의한 자를 말합니다 이하 "회원"이라고 합니다.)이 200ok(이하 “회사”이라 한다)에서 운영하는 DEVzine:port(이하 "사이트"라 한다)에서 제공하는 모든 서비스(이하 “서비스”라 한다)를 이용함에 있어 회사와 회원의 권리, 의무 및 책임사항을 규정함을 목적으로합니다.\n\n제2조(용어의 정의)\n1.  “회원”이란 사이트에 접속하여 이 약관에 따라 회사가 제공하는 서비스를 받는 이용자를 말합니다.\n2. “서비스"란 회원이 이용할 수 있는 회사 및 회사 관련 제반 서비스를 의미합니다.\n\n제3조 (약관 등의 명시와 설명 및 개정)\n1. 회사는 이 약관의 내용과 상호 및 대표자 성명, 전화번호, 전자우편주소등을 회원이 쉽게 알 수 있도록 서비스의 페이지에 게시합니다. 다만, 약관의 내용은 회원이 연결화면을 통하여 볼 수 있도록 할 수 있습니다.\n2. 회사는 콘텐츠산업 진흥법, 정보통신망 이용촉진 및 정보보호 등에 관한 법률, 약관의 규제에 관한 법률, 소비자기본법 등 관련 법령을 위배하지 않는 범위에서 이 약관을 개정할 수 있습니다.\n3. 회사가 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여 현행약관과 함께 서비스의 초기화면에 그 적용일자 7일 이전부터 적용일자 전일까지 공지합니다. 다만, 회원에게 불리하게 약관내용을 변경하는 경우에는 최소한 30일 이상의 사전 유예기간을 두고 공지합니다. 이 경우 회사는 개정 전 내용과 개정 후 내용을 명확하게 비교하여 회원이 알기 쉽도록 표시합니다.\n4. 회사가 약관을 개정할 경우에는 그 개정약관은 그 적용일자 이후에 체결되는 계약에만 적용되고 그 이전에 이미 체결된 계약에 대해서는 개정 전의 약관조항이 그대로 적용됩니다. 다만 이미 계약을 체결한 회원이 개정약관 조항의 적용을 받기를 원하는 뜻을 제3항에 의한 개정약관의 공지기간 내에 회사에 송신하여 회사의 동의를 받은 경우에는 개정약관 조항이 적용됩니다.\n5. 이 약관에서 정하지 아니한 사항과 이 약관의 해석에 관하여는 소비자보호에 관한 법률, 약관의 규제 등에 관한 법률, 공정거래위원회가 정하는 전자상거래 등에서의 소비자 보호지침 및 관계법령 또는 상관례에 따릅니다.\n\n제4조(서비스의 제공 및 변경)\n1. 회사는 회원에게 아래와 같은 서비스를 제공합니다.\n* 정보 제공\n* 기타 회사가 추가 개발하거나 다른 회사와의 제휴계약 등을 통해 회원에게 제공하는 일체의 서비스\n2. 회사는 회원과 별도로 서면 계약을 체결하여 회사 서비스 및 제반 서비스의 브랜드 특성을 이용할 수 있는 명시적인 권리를 부여하지 아니하는 한, 회원에게 회사 또는 서비스의 상호, 상표, 서비스표, 로고, 도메인 네임 및 기타 식별력 있는 브랜드 특성을 이용할 수 있는 권리를 부여하지 않습니다.\n3. 회사가 제공하는 서비스의 형태와 기능, 디자인 등 필요한 경우 수시로 변경되거나, 중단될 수 있습니다. 회사는 이 경우 개별적인 변경에 대해서 회원에게 사전 통지하지 않습니다. 다만, 회원에게 불리한 것으로 판단되는 경우 전자우편으로 통하여 이를 공지합니다.\n\n제5조(서비스의 중단)\n1. 회사는 컴퓨터 등 정보통신설비의 보수점검.교체 및 고장, 통신의 두절 등의 사유가 발생한 경우에는 서비스의 제공을 일시적으로 중단할 수 있습니다.\n2. 회사는 제1항의 사유로 서비스의 제공이 일시적으로 중단됨으로 인하여 회원 또는 제3자가 입은 손해에 대하여 배상합니다. 단, 회사가 고의 또는 과실이 없음을 입증하는 경우에는 그러하지 아니합니다.\n3. 사업종목의 전환, 사업의 포기, 업체 간의 통합 등의 이유로 서비스를 제공할 수 없게 되는 경우에는 회사는 제8조에 정한 방법으로 회원에게 통지하고 당초 회사에서 제시한 조건에 따라 소비자에게 보상합니다. 다만, 회사가 보상기준 등을 고지하지 아니한 경우에는 회원들의 마일리지 또는 적립금 등을 회사에서 통용되는 통화가치에 상응하는 현물 또는 현금으로 회원에게 지급합니다.\n\n제6조(회원가입)\n1. 회원은 회사가 정한 가입 양식에 따라 회원정보를 기입한 후 이 약관에 동의한다는 의사표시를 함으로서 회원가입을 신청합니다.\n2. 회사는 제1항과 같이 회원으로 가입할 것을 신청한 회원 중 다음 각 호에 해당하지 않는 한 회원으로 등록합니다.\n* 가입신청자가 이 약관 제7조제3항에 의하여 이전에 회원자격을 상실한 적이 있는 경우, 다만 제7조제3항에 의한 회원 자격 상실 후 3년이 경과한 자로서 회사의 회원재가입 승낙을 얻은 경우에는 예외로 한다.\n* 등록 내용에 허위, 기재누락, 오기가 있는 경우\n* 기타 회원으로 등록하는 것이 회사의 기술상 현저히 지장이 있다고 판단되는 경우\n3. 회원가입계약의 성립 시기는 회사의 승낙이 회원에게 도달한 시점으로 합니다.\n4. 회원은 회원가입시등록한 사항에 변경이 있는 경우, 상당한 기간 이내에 회사에 대하여 회원정보 수정 등의 방법으로 그 변경사항을 알려야 합니다.\n\n제7조(회원 탈퇴 및 자격 상실 등)\n1. 회원은 회사에 언제든지 탈퇴를 요청할 수 있으며 회사는 즉시 회원탈퇴를 처리합니다.\n2. 회사는 회원이 다음 각 호의 사유에 해당하는 경우, 회원자격을 제한 및 정지시킬 수 있습니다.\n* 가입 신청 시에 허위 내용을 등록한 경우\n* 회사을 이용하여 구입한 재화 등의 대금, 기타 회사가용에 관련하여 회원이 부담하는 채무를 기일에 지급하지 않는 경우\n* 다른 사람의 회사 이용을 방해하거나 그 정보를 도용하는 등 전자상거래 질서를 위협하는 경우\n* 회사을 이용하여 법령 또는 이 약관이 금지하거나 공서양속에 반하는 행위를 하는 경우\n3. 회사가 회원 자격을 제한.정지 시킨 후, 동일한 행위가 2회 이상 반복되거나 30일 이내에 그 사유가 시정되지 아니하는 경우 회사는 회원자격을 상실시킬 수 있습니다.\n4. 회사가 회원자격을 상실시키는 경우에는 회원등록을 말소합니다. 이 경우 회원에게 이를 통지하고, 회원등록 말소 전에 최소한 30일 이상의 기간을 정하여 소명할 기회를 부여합니다.\n\n제8조(회원에 대한 통지)\n1. 회사가 회원에 대한 통지를 하는 경우, 회원이 회사과 미리 약정하여 지정한 전자우편 주소로 할 수 있습니다.\n2. 회사는 서비스 운영을 위해 회원정보를 활용하여 영리목적의 광고성 전자우편을 전송할 수 있습니다. 회원이 이를 원하지 않는 경우에는 언제든지 서비스 홈페이지 또는 서비스 내부 설정페이지 등을 통하여 수신거부를 할 수 있습니다.\n3. 회사는 불특정다수 회원에 대한 통지의 경우 1주일이상 회사 게시판에 게시함으로서 개별 통지에 갈음할 수 있습니다. 다만, 회원 본인의 거래와 관련하여 중대한 영향을 미치는 사항에 대하여는 개별통지를 합니다.\n4. 회사는 다음 각호에 해당하는 경우 회원의 동의여부와 상관없이 전자우편으로 발송할 수 있습니다.\n* 이용 신청에서 입력한 전자우편 주소의 소유를 확인하기 위해서 인증메일을 발송하는 경우\n* 기타 서비스를 제공함에 있어 회원이 반드시 알아야 하는 중대한 정보라고 회사가 판단하는 경우(회원 가입 및 탈퇴 안내 등)\n\n제9조 서비스 이용의 기술적 요구사항\n회사는 서비스를 공급하면서 아래의 <서비스 이용 필수 사양>이 충족되어야 정상적인 서비스 이용이 가능하며, 회원이 아래의 필수 사양을 충족하지 못하여 서비스 이용이 제한되더라도 회원은 이를 이유로 회사에 이의를 제기할 수 없습니다.\n<서비스 이용 필수 사양>\n1. 컴퓨터(PC) - 운영체제(OS) : Windows , OSX , Linux 등 웹브라우저 이용이 가능한 OS - 웹브라우저 : Chrome , Safari , Firefox 웹 브라우저\n2. 모바일 단말기 (Smart Phone, 태블렛 PC) - 지원단말기 : 안드로이드, 아이폰, 아이패드, 갤럭시탭\n\n제10조(회사의 의무)\n1. 회사는 법령과 이 약관이 금지하거나 공서양속에 반하는 행위를 하지 않으며 이 약관이 정하는 바에 따라 지속적이고, 안정적으로 재화.용역을 제공하는데 최선을 다하여야 합니다.\n2. 회사는 회원이 안전하게 인터넷 서비스를 이용할 수 있도록 회원의 개인정보(신용정보 포함)보호를 위한 보안 시스템을 갖추어야 합니다.\n3. 회사는 상품이나 용역에 대하여 「표시.광고의 공정화에 관한 법률」 제3조 소정의 부당한 표시.광고행위를 함으로써 회원이 손해를 입은 때에는 이를 배상할 책임을 집니다.\n4. 회사는 회원이 원하지 않는 영리목적의 광고성 전자우편을 발송하지 않습니다.\n\n제11조(회원의 ID 및 비밀번호에 대한 의무)\n1. 회원은 아이디와 비빌번호에 관해서 관리책임이 있습니다\n2. 회원은 자신의 ID 및 비밀번호를 제3자에게 이용하게 해서는 안됩니다.\n3. 회원이 자신의 ID 및 비밀번호를 도난당하거나 제3자가 사용하고 있음을 인지한 경우에는 바로 회사에 통보하고 회사의 안내가 있는 경우에는 그에 따라야 합니다.\n4. 회사는 회원이 아이디 및 비밀번호를 소홀히 관리하여 발생하는 서비스 이용상의 손해 또는 회사의 고의 또는 중대한 과실이 없는 제3자의 부정이용 등으로 인한 손해에 대해 책임을 지지 않습니다.\n\n제12조(회원의 의무)\n회원은 다음 행위를 하여서는 안 됩니다.\n1. 신청 또는 변경시 허위 내용의 등록\n2. 타인의 정보 도용\n3. 회사에 게시된 정보의 변경\n4. 회사가 정한 정보 이외의 정보(컴퓨터 프로그램 등) 등의 송신 또는 게시\n5. 회사 기타 제3자의 저작권 등 지적재산권에 대한 침해\n6. 회사 기타 제3자의 명예를 손상시키거나 업무를 방해하는 행위\n7. 외설 또는 폭력적인 메시지, 화상, 음성, 기타 공서양속에 반하는 정보를 몰에 공개 또는 게시하는 행위\n\n제13조(저작권의 귀속 및 이용제한)\n1.  회사가 작성한 저작물에 대한 저작권 기타 지적재산권은 회사에 귀속합니다.\n2. 회원은 서비스를 이용함으로써 얻은 정보 중 회사에게 지적재산권이 귀속된 정보를 회사의 사전 승낙 없이 복제, 송신, 출판, 배포, 방송 기타 방법에 의하여 영리목적으로 이용하거나 제3자에게 이용하게 하여서는 안됩니다.\n3. 회사는 약정에 따라 회원에게 귀속된 저작권을 사용하는 경우 당해 회원에게 통보하여야 합니다.\n\n제14조 약관의 해석\n이 약관에 명시되지 않은 사항에 대해서는 회사와 회원 간 합의하여 결정하고, 합의가 되지 않는 경우 관련 법령 또는 상관례에 따릅니다.\n\n제15조(재판권 및 준거법)\n1.  회사과 회원 간에 발생한 전자상거래 분쟁에 관한 소송은 제소 당시의 회원의 주소에 의하고, 주소가 없는 경우에는 거소를 관할하는 지방법원의 전속관할로 합니다. 다만, 제소 당시 회원의 주소 또는 거소가 분명하지 않거나 외국 거주자의 경우에는 민사소송법상의 관할법원에 제기합니다.\n2.  회사과 회원 간에 제기된 전자상거래 소송에는 한국법을 적용합니다.',
  ],
];
